app/controllers/search_results_controller.rb

  def show_department
    @department = params[:dpm]
    @all_courses = Course.search_by_dept(@department)

    if @all_courses == nil || @all_courses.empty?
---
SELECT COUNT(*) FROM `courses` WHERE (department LIKE '%Computer Science%')
SELECT `courses`.* FROM `courses` WHERE (department LIKE '%Computer Science%')